feaser/openblt/dhcp_support/Target/Demo/ARMCM3_LM3S_EK_LM3S6965_Crossworks/Prog/lib/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the GPIO API.
//
//*****************************************************************************
#ifdef ROM_GPIOPinWrite
#define MAP_GPIOPinWrite \
        ROM_GPIOPinWrite
#else
#define MAP_GPIOPinWrite \
        GPIOPinWrite
#endif
#ifdef ROM_GPIODirModeSet
#define MAP_GPIODirModeSet \
        ROM_GPIODirModeSet
#else
#define MAP_GPIODirModeSet \
        GPIODirModeSet
#endif
#ifdef ROM_GPIODirModeGet
#define MAP_GPIODirModeGet \
        ROM_GPIODirModeGet
#else
#define MAP_GPIODirModeGet \
        GPIODirModeGet
#endif
#ifdef ROM_GPIOIntTypeSet
#define MAP_GPIOIntTypeSet \
        ROM_GPIOIntTypeSet
#else
#define MAP_GPIOIntTypeSet \
        GPIOIntTypeSet
#endif
#ifdef ROM_GPIOIntTypeGet
#define MAP_GPIOIntTypeGet \
        ROM_GPIOIntTypeGet
#else
#define MAP_GPIOIntTypeGet \
        GPIOIntTypeGet
#endif
#ifdef ROM_GPIOPadConfigSet
#define MAP_GPIOPadConfigSet \
        ROM_GPIOPadConfigSet
#else
#define MAP_GPIOPadConfigSet \
        GPIOPadConfigSet
#endif
#ifdef ROM_GPIOPadConfigGet
#define MAP_GPIOPadConfigGet \
        ROM_GPIOPadConfigGet
#else
#define MAP_GPIOPadConfigGet \
        GPIOPadConfigGet
#endif
#ifdef ROM_GPIOPinIntEnable
#define MAP_GPIOPinIntEnable \
        ROM_GPIOPinIntEnable
#else
#define MAP_GPIOPinIntEnable \
        GPIOPinIntEnable
#endif
#ifdef ROM_GPIOPinIntDisable
#define MAP_GPIOPinIntDisable \
        ROM_GPIOPinIntDisable
#else
#define MAP_GPIOPinIntDisable \
        GPIOPinIntDisable
#endif
#ifdef ROM_GPIOPinIntStatus
#define MAP_GPIOPinIntStatus \
        ROM_GPIOPinIntStatus
#else
#define MAP_GPIOPinIntStatus \
        GPIOPinIntStatus
#endif
#ifdef ROM_GPIOPinIntClear
#define MAP_GPIOPinIntClear \
        ROM_GPIOPinIntClear
#else
#define MAP_GPIOPinIntClear \
        GPIOPinIntClear
#endif
#ifdef ROM_GPIOPinRead
#define MAP_GPIOPinRead \
        ROM_GPIOPinRead
#else
#define MAP_GPIOPinRead \
        GPIOPinRead
#endif
#ifdef ROM_GPIOPinTypeCAN
#define MAP_GPIOPinTypeCAN \
        ROM_GPIOPinTypeCAN
#else
#define MAP_GPIOPinTypeCAN \
        GPIOPinTypeCAN
#endif
#ifdef ROM_GPIOPinTypeComparator
#define MAP_GPIOPinTypeComparator \
        ROM_GPIOPinTypeComparator
#else
#define MAP_GPIOPinTypeComparator \
        GPIOPinTypeComparator
#endif
#ifdef ROM_GPIOPinTypeGPIOInput
#define MAP_GPIOPinTypeGPIOInput \
        ROM_GPIOPinTypeGPIOInput
#else
#define MAP_GPIOPinTypeGPIOInput \
        GPIOPinTypeGPIOInput
#endif
#ifdef ROM_GPIOPinTypeGPIOOutput
#define MAP_GPIOPinTypeGPIOOutput \
        ROM_GPIOPinTypeGPIOOutput
#else
#define MAP_GPIOPinTypeGPIOOutput \
        GPIOPinTypeGPIOOutput
#endif
#ifdef ROM_GPIOPinTypeI2C
#define MAP_GPIOPinTypeI2C \
        ROM_GPIOPinTypeI2C
#else
#define MAP_GPIOPinTypeI2C \
        GPIOPinTypeI2C
#endif
#ifdef ROM_GPIOPinTypePWM
#define MAP_GPIOPinTypePWM \
        ROM_GPIOPinTypePWM
#else
#define MAP_GPIOPinTypePWM \
        GPIOPinTypePWM
#endif
#ifdef ROM_GPIOPinTypeQEI
#define MAP_GPIOPinTypeQEI \
        ROM_GPIOPinTypeQEI
#else
#define MAP_GPIOPinTypeQEI \
        GPIOPinTypeQEI
#endif
#ifdef ROM_GPIOPinTypeSSI
#define MAP_GPIOPinTypeSSI \
        ROM_GPIOPinTypeSSI
#else
#define MAP_GPIOPinTypeSSI \
        GPIOPinTypeSSI
#endif
#ifdef ROM_GPIOPinTypeTimer
#define MAP_GPIOPinTypeTimer \
        ROM_GPIOPinTypeTimer
#else
#define MAP_GPIOPinTypeTimer \
        GPIOPinTypeTimer
#endif
#ifdef ROM_GPIOPinTypeUART
#define MAP_GPIOPinTypeUART \
        ROM_GPIOPinTypeUART
#else
#define MAP_GPIOPinTypeUART \
        GPIOPinTypeUART
#endif
#ifdef ROM_GPIOPinTypeGPIOOutputOD
#define MAP_GPIOPinTypeGPIOOutputOD \
        ROM_GPIOPinTypeGPIOOutputOD
#else
#define MAP_GPIOPinTypeGPIOOutputOD \
        GPIOPinTypeGPIOOutputOD
#endif
#ifdef ROM_GPIOPinTypeADC
#define MAP_GPIOPinTypeADC \
        ROM_GPIOPinTypeADC
#else
#define MAP_GPIOPinTypeADC \
        GPIOPinTypeADC
#endif
#ifdef ROM_GPIOPinTypeUSBDigital
#define MAP_GPIOPinTypeUSBDigital \
        ROM_GPIOPinTypeUSBDigital
#else
#define MAP_GPIOPinTypeUSBDigital \
        GPIOPinTypeUSBDigital
#endif
#ifdef ROM_GPIOPinTypeI2S
#define MAP_GPIOPinTypeI2S \
        ROM_GPIOPinTypeI2S
#else
#define MAP_GPIOPinTypeI2S \
        GPIOPinTypeI2S
#endif
#ifdef ROM_GPIOPinConfigure
#define MAP_GPIOPinConfigure \
        ROM_GPIOPinConfigure
#else
#define MAP_GPIOPinConfigure \
        GPIOPinConfigure
#endif
#ifdef ROM_GPIOPinTypeEthernetLED
#define MAP_GPIOPinTypeEthernetLED \
        ROM_GPIOPinTypeEthernetLED
#else
#define MAP_GPIOPinTypeEthernetLED \
        GPIOPinTypeEthernetLED
#endif
#ifdef ROM_GPIOPinTypeUSBAnalog
#define MAP_GPIOPinTypeUSBAnalog \
        ROM_GPIOPinTypeUSBAnalog
#else
#define MAP_GPIOPinTypeUSBAnalog \
        GPIOPinTypeUSBAnalog
#endif
#ifdef ROM_GPIOPinTypeEPI
#define MAP_GPIOPinTypeEPI \
        ROM_GPIOPinTypeEPI
#else
#define MAP_GPIOPinTypeEPI \
        GPIOPinTypeEPI
#endif
#ifdef ROM_GPIOPinTypeEthernetMII
#define MAP_GPIOPinTypeEthernetMII \
        ROM_GPIOPinTypeEthernetMII
#else
#define MAP_GPIOPinTypeEthernetMII \
        GPIOPinTypeEthernetMII
#endif

//*****************************************************************************
//
// Macros for the Hibernate API.
//
//*****************************************************************************
#ifdef ROM_HibernateIntClear
#define MAP_HibernateIntClear \
        ROM_HibernateIntClear
#else
#define MAP_HibernateIntClear \
        HibernateIntClear
#endif
#ifdef ROM_HibernateEnableExpClk
#define MAP_HibernateEnableExpClk \
        ROM_HibernateEnableExpClk
#else
#define MAP_HibernateEnableExpClk \
        HibernateEnableExpClk
#endif
#ifdef ROM_HibernateDisable
#define MAP_HibernateDisable \
        ROM_HibernateDisable
#else
#define MAP_HibernateDisable \
        HibernateDisable
#endif
#ifdef ROM_HibernateClockSelect
#define MAP_HibernateClockSelect \
        ROM_HibernateClockSelect
#else
#define MAP_HibernateClockSelect \
        HibernateClockSelect
#endif
#ifdef ROM_HibernateRTCEnable
#define MAP_HibernateRTCEnable \
        ROM_HibernateRTCEnable
#else
#define MAP_HibernateRTCEnable \
        HibernateRTCEnable
#endif
#ifdef ROM_HibernateRTCDisable
#define MAP_HibernateRTCDisable \
        ROM_HibernateRTCDisable
#else
#define MAP_HibernateRTCDisable \
        HibernateRTCDisable
#endif
#ifdef ROM_HibernateWakeSet
#define MAP_HibernateWakeSet \
        ROM_HibernateWakeSet
#else
#define MAP_HibernateWakeSet \
        HibernateWakeSet
#endif
#ifdef ROM_HibernateWakeGet
#define MAP_HibernateWakeGet \
        ROM_HibernateWakeGet
#else
#define MAP_HibernateWakeGet \
        HibernateWakeGet
#endif
#ifdef ROM_HibernateLowBatSet
#define MAP_HibernateLowBatSet \
        ROM_HibernateLowBatSet
#else
#define MAP_HibernateLowBatSet \
        HibernateLowBatSet
#endif
#ifdef ROM_HibernateLowBatGet
#define MAP_HibernateLowBatGet \
        ROM_HibernateLowBatGet
#else
#define MAP_HibernateLowBatGet \
        HibernateLowBatGet
#endif
#ifdef ROM_HibernateRTCSet
#define MAP_HibernateRTCSet \
        ROM_HibernateRTCSet
#else
#define MAP_HibernateRTCSet \
        HibernateRTCSet
#endif
#ifdef ROM_HibernateRTCGet
#define MAP_HibernateRTCGet \
        ROM_HibernateRTCGet
#else
#define MAP_HibernateRTCGet \
        HibernateRTCGet
#endif
#ifdef ROM_HibernateRTCMatch0Set
#define MAP_HibernateRTCMatch0Set \
        ROM_HibernateRTCMatch0Set
#else
#define MAP_HibernateRTCMatch0Set \
        HibernateRTCMatch0Set
#endif
#ifdef ROM_HibernateRTCMatch0Get
#define MAP_HibernateRTCMatch0Get \
        ROM_HibernateRTCMatch0Get
#else
#define MAP_HibernateRTCMatch0Get \
        HibernateRTCMatch0Get
#endif
#ifdef ROM_HibernateRTCMatch1Set
#define MAP_HibernateRTCMatch1Set \
        ROM_HibernateRTCMatch1Set
#else
#define MAP_HibernateRTCMatch1Set \
        HibernateRTCMatch1Set
#endif
#ifdef ROM_HibernateRTCMatch1Get
#define MAP_HibernateRTCMatch1Get \
        ROM_HibernateRTCMatch1Get
#else
#define MAP_HibernateRTCMatch1Get \
        HibernateRTCMatch1Get
#endif
#ifdef ROM_HibernateRTCTrimSet
#define MAP_HibernateRTCTrimSet \
        ROM_HibernateRTCTrimSet
#else
#define MAP_HibernateRTCTrimSet \
        HibernateRTCTrimSet
#endif
#ifdef ROM_HibernateRTCTrimGet
#define MAP_HibernateRTCTrimGet \
        ROM_HibernateRTCTrimGet
#else
#define MAP_HibernateRTCTrimGet \
        HibernateRTCTrimGet
#endif
#ifdef ROM_HibernateDataSet
#define MAP_HibernateDataSet \
        ROM_HibernateDataSet
#else
#define MAP_HibernateDataSet \
        HibernateDataSet
#endif
#ifdef ROM_HibernateDataGet
#define MAP_HibernateDataGet \
        ROM_HibernateDataGet
#else
#define MAP_HibernateDataGet \
        HibernateDataGet
#endif
#ifdef ROM_HibernateRequest
#define MAP_HibernateRequest \
        ROM_HibernateRequest
#else
#define MAP_HibernateRequest \
        HibernateRequest
#endif
#ifdef ROM_HibernateIntEnable
#define MAP_HibernateIntEnable \
        ROM_HibernateIntEnable
#else
#define MAP_HibernateIntEnable \
        HibernateIntEnable
#endif
#ifdef ROM_HibernateIntDisable
#define MAP_HibernateIntDisable \
        ROM_HibernateIntDisable
#else
#define MAP_HibernateIntDisable \
        HibernateIntDisable
#endif
#ifdef ROM_HibernateIntStatus
#define MAP_HibernateIntStatus \
        ROM_HibernateIntStatus
#else
#define MAP_HibernateIntStatus \
        HibernateIntStatus
#endif
#ifdef ROM_HibernateIsActive
#define MAP_HibernateIsActive \
        ROM_HibernateIsActive
#else
#define MAP_HibernateIsActive \
        HibernateIsActive
#endif

//*****************************************************************************
//
// Macros for the I2C API.
//
//*****************************************************************************
#ifdef ROM_I2CMasterDataPut
#define MAP_I2CMasterDataPut \
        ROM_I2CMasterDataPut
#else
#define MAP_I2CMasterDataPut \
        I2CMasterDataPut
#endif
#ifdef ROM_I2CMasterInitExpClk
#define MAP_I2CMasterInitExpClk \
        ROM_I2CMasterInitExpClk
#else
#define MAP_I2CMasterInitExpClk \
        I2CMasterInitExpClk
#endif
#ifdef ROM_I2CSlaveInit
#define MAP_I2CSlaveInit \
        ROM_I2CSlaveInit
#else
#define MAP_I2CSlaveInit \
        I2CSlaveInit
#endif
#ifdef ROM_I2CMasterEnable
#define MAP_I2CMasterEnable \
        ROM_I2CMasterEnable
#else
#define MAP_I2CMasterEnable \
        I2CMasterEnable
#endif
#ifdef ROM_I2CSlaveEnable
#define MAP_I2CSlaveEnable \
        ROM_I2CSlaveEnable
#else
#define MAP_I2CSlaveEnable \
        I2CSlaveEnable
#endif
#ifdef ROM_I2CMasterDisable
#define MAP_I2CMasterDisable \
        ROM_I2CMasterDisable
#else
#define MAP_I2CMasterDisable \
        I2CMasterDisable
#endif
#ifdef ROM_I2CSlaveDisable
#define MAP_I2CSlaveDisable \
        ROM_I2CSlaveDisable
#else
#define MAP_I2CSlaveDisable \
        I2CSlaveDisable
#endif
#ifdef ROM_I2CMasterIntEnable
#define MAP_I2CMasterIntEnable \
        ROM_I2CMasterIntEnable
#else
#define MAP_I2CMasterIntEnable \
        I2CMasterIntEnable
#endif
#ifdef ROM_I2CSlaveIntEnable
#define MAP_I2CSlaveIntEnable \
        ROM_I2CSlaveIntEnable
#else
#define MAP_I2CSlaveIntEnable \
        I2CSlaveIntEnable
#endif
#ifdef ROM_I2CMasterIntDisable
#define MAP_I2CMasterIntDisable \
        ROM_I2CMasterIntDisable
#else
#define MAP_I2CMasterIntDisable \
        I2CMasterIntDisable
#endif
#ifdef ROM_I2CSlaveIntDisable
#define MAP_I2CSlaveIntDisable \
        ROM_I2CSlaveIntDisable
#else
#define MAP_I2CSlaveIntDisable \
        I2CSlaveIntDisable
#endif
#ifdef ROM_I2CMasterIntStatus
#define MAP_I2CMasterIntStatus \
        ROM_I2CMasterIntStatus
#else
#define MAP_I2CMasterIntStatus \
        I2CMasterIntStatus
#endif
#ifdef ROM_I2CSlaveIntStatus
#define MAP_I2CSlaveIntStatus \
        ROM_I2CSlaveIntStatus
#else
#define MAP_I2CSlaveIntStatus \
        I2CSlaveIntStatus
#endif
#ifdef ROM_I2CMasterIntClear
#define MAP_I2CMasterIntClear \
        ROM_I2CMasterIntClear
#else
#define MAP_I2CMasterIntClear \
        I2CMasterIntClear
#endif
#ifdef ROM_I2CSlaveIntClear
#define MAP_I2CSlaveIntClear \
        ROM_I2CSlaveIntClear
#else
#define MAP_I2CSlaveIntClear \
        I2CSlaveIntClear
#endif
#ifdef ROM_I2CMasterSlaveAddrSet
#define MAP_I2CMasterSlaveAddrSet \
        ROM_I2CMasterSlaveAddrSet
#else
#define MAP_I2CMasterSlaveAddrSet \
        I2CMasterSlaveAddrSet
#endif
#ifdef ROM_I2CMasterBusy
#define MAP_I2CMasterBusy \
        ROM_I2CMasterBusy
#else
#define MAP_I2CMasterBusy \
        I2CMasterBusy
#endif
#ifdef ROM_I2CMasterBusBusy
#define MAP_I2CMasterBusBusy \
        ROM_I2CMasterBusBusy
#else
#define MAP_I2CMasterBusBusy \
        I2CMasterBusBusy
#endif
#ifdef ROM_I2CMasterControl
#define MAP_I2CMasterControl \
        ROM_I2CMasterControl
#else
#define MAP_I2CMasterControl \
        I2CMasterControl
#endif
#ifdef ROM_I2CMasterErr
#define MAP_I2CMasterErr \
        ROM_I2CMasterErr
#else
#define MAP_I2CMasterErr \
        I2CMasterErr
#endif
#ifdef ROM_I2CMasterDataGet
#define MAP_I2CMasterDataGet \
        ROM_I2CMasterDataGet
#else
#define MAP_I2CMasterDataGet \
        I2CMasterDataGet
#endif
#ifdef ROM_I2CSlaveStatus
#define MAP_I2CSlaveStatus \
        ROM_I2CSlaveStatus
#else
#define MAP_I2CSlaveStatus \
        I2CSlaveStatus
#endif
#ifdef ROM_I2CSlaveDataPut
#define MAP_I2CSlaveDataPut \
        ROM_I2CSlaveDataPut
#else
#define MAP_I2CSlaveDataPut \
        I2CSlaveDataPut
#endif
#ifdef ROM_I2CSlaveDataGet
#define MAP_I2CSlaveDataGet \
        ROM_I2CSlaveDataGet
#else
#define MAP_I2CSlaveDataGet \
        I2CSlaveDataGet
#endif
#ifdef ROM_I2CSlaveIntEnableEx
#define MAP_I2CSlaveIntEnableEx \
        ROM_I2CSlaveIntEnableEx
#else
#define MAP_I2CSlaveIntEnableEx \
        I2CSlaveIntEnableEx
#endif
#ifdef ROM_I2CSlaveIntDisableEx
#define MAP_I2CSlaveIntDisableEx \
        ROM_I2CSlaveIntDisableEx
#else
#define MAP_I2CSlaveIntDisableEx \
        I2CSlaveIntDisableEx
#endif
#ifdef ROM_I2CSlaveIntStatusEx
#define MAP_I2CSlaveIntStatusEx \
        ROM_I2CSlaveIntStatusEx
#else
#define MAP_I2CSlaveIntStatusEx \
        I2CSlaveIntStatusEx
#endif
#ifdef ROM_I2CSlaveIntClearEx
#define MAP_I2CSlaveIntClearEx \
        ROM_I2CSlaveIntClearEx
#else
#define MAP_I2CSlaveIntClearEx \
        I2CSlaveIntClearEx
#endif

//*****************************************************************************
//
// Macros for the I2S API.
//
//*****************************************************************************
#ifdef ROM_I2SIntStatus
#define MAP_I2SIntStatus \
        ROM_I2SIntStatus
#else
#define MAP_I2SIntStatus \
        I2SIntStatus
#endif
#ifdef ROM_I2STxEnable
#define MAP_I2STxEnable \
        ROM_I2STxEnable
#else
#define MAP_I2STxEnable \
        I2STxEnable
#endif
#ifdef ROM_I2STxDisable
#define MAP_I2STxDisable \
        ROM_I2STxDisable
#else
#define MAP_I2STxDisable \
        I2STxDisable
#endif
#ifdef ROM_I2STxDataPut
#define MAP_I2STxDataPut \
        ROM_I2STxDataPut
#else
#define MAP_I2STxDataPut \
        I2STxDataPut
#endif
#ifdef ROM_I2STxDataPutNonBlocking
#define MAP_I2STxDataPutNonBlocking \
        ROM_I2STxDataPutNonBlocking
#else
#define MAP_I2STxDataPutNonBlocking \
        I2STxDataPutNonBlocking
#endif
#ifdef ROM_I2STxConfigSet
#define MAP_I2STxConfigSet \
        ROM_I2STxConfigSet
#else
#define MAP_I2STxConfigSet \
        I2STxConfigSet
#endif
#ifdef ROM_I2STxFIFOLimitSet
#define MAP_I2STxFIFOLimitSet \
        ROM_I2STxFIFOLimitSet
#else
#define MAP_I2STxFIFOLimitSet \
        I2STxFIFOLimitSet
#endif
#ifdef ROM_I2STxFIFOLimitGet
#define MAP_I2STxFIFOLimitGet \
        ROM_I2STxFIFOLimitGet
#else
#define MAP_I2STxFIFOLimitGet \
        I2STxFIFOLimitGet
#endif
#ifdef ROM_I2STxFIFOLevelGet
#define MAP_I2STxFIFOLevelGet \
        ROM_I2STxFIFOLevelGet
#else
#define MAP_I2STxFIFOLevelGet \
        I2STxFIFOLevelGet
#endif
#ifdef ROM_I2SRxEnable
#define MAP_I2SRxEnable \
        ROM_I2SRxEnable
#else
#define MAP_I2SRxEnable \
        I2SRxEnable
#endif
#ifdef ROM_I2SRxDisable
#define MAP_I2SRxDisable \
        ROM_I2SRxDisable
#else
#define MAP_I2SRxDisable \
        I2SRxDisable
#endif
#ifdef ROM_I2SRxDataGet
#define MAP_I2SRxDataGet \
        ROM_I2SRxDataGet
#else
#define MAP_I2SRxDataGet \
        I2SRxDataGet
#endif
#ifdef ROM_I2SRxDataGetNonBlocking
#define MAP_I2SRxDataGetNonBlocking \
        ROM_I2SRxDataGetNonBlocking
#else
#define MAP_I2SRxDataGetNonBlocking \
        I2SRxDataGetNonBlocking
#endif
#ifdef ROM_I2SRxConfigSet
#define MAP_I2SRxConfigSet \
        ROM_I2SRxConfigSet
#else
#define MAP_I2SRxConfigSet \
        I2SRxConfigSet
#endif
#ifdef ROM_I2SRxFIFOLimitSet
#define MAP_I2SRxFIFOLimitSet \
        ROM_I2SRxFIFOLimitSet
#else
#define MAP_I2SRxFIFOLimitSet \
        I2SRxFIFOLimitSet
#endif
#ifdef ROM_I2SRxFIFOLimitGet
#define MAP_I2SRxFIFOLimitGet \
        ROM_I2SRxFIFOLimitGet
#else
#define MAP_I2SRxFIFOLimitGet \
        I2SRxFIFOLimitGet
#endif
#ifdef ROM_I2SRxFIFOLevelGet
#define MAP_I2SRxFIFOLevelGet \
        ROM_I2SRxFIFOLevelGet
#else
#define MAP_I2SRxFIFOLevelGet \
        I2SRxFIFOLevelGet
#endif
#ifdef ROM_I2STxRxEnable
#define MAP_I2STxRxEnable \
        ROM_I2STxRxEnable
#else
#define MAP_I2STxRxEnable \
        I2STxRxEnable
#endif
#ifdef ROM_I2STxRxDisable
#define MAP_I2STxRxDisable \
        ROM_I2STxRxDisable
#else
#define MAP_I2STxRxDisable \
        I2STxRxDisable
#endif
#ifdef ROM_I2STxRxConfigSet
#define MAP_I2STxRxConfigSet \
        ROM_I2STxRxConfigSet
#else
#define MAP_I2STxRxConfigSet \
        I2STxRxConfigSet
#endif
#ifdef ROM_I2SMasterClockSelect
#define MAP_I2SMasterClockSelect \
        ROM_I2SMasterClockSelect
#else
#define MAP_I2SMasterClockSelect \
        I2SMasterClockSelect
#endif
#ifdef ROM_I2SIntEnable
#define MAP_I2SIntEnable \
        ROM_I2SIntEnable
#else
#define MAP_I2SIntEnable \
        I2SIntEnable
#endif
#ifdef ROM_I2SIntDisable
#define MAP_I2SIntDisable \
        ROM_I2SIntDisable
#else
#define MAP_I2SIntDisable \
        I2SIntDisable
#endif
#ifdef ROM_I2SIntClear
#define MAP_I2SIntClear \
        ROM_I2SIntClear
#else
#define MAP_I2SIntClear \
        I2SIntClear
#endif

//*****************************************************************************
//
// Macros for the Interrupt API.
//
//*****************************************************************************
#ifdef ROM_IntEnable
#define MAP_IntEnable \
        ROM_IntEnable
#else
#define MAP_IntEnable \
        IntEnable
#endif
#ifdef ROM_IntMasterEnable
#define MAP_IntMasterEnable \
        ROM_IntMasterEnable
#else
#define MAP_IntMasterEnable \
        IntMasterEnable
#endif
#ifdef ROM_IntMasterDisable
#define MAP_IntMasterDisable \
        ROM_IntMasterDisable
#else
#define MAP_IntMasterDisable \
        IntMasterDisable
#endif
#ifdef ROM_IntDisable
#define MAP_IntDisable \
        ROM_IntDisable
#else
#define MAP_IntDisable \
        IntDisable
#endif
#ifdef ROM_IntPriorityGroupingSet
#define MAP_IntPriorityGroupingSet \
        ROM_IntPriorityGroupingSet
#else
#define MAP_IntPriorityGroupingSet \
        IntPriorityGroupingSet
#endif
#ifdef ROM_IntPriorityGroupingGet
#define MAP_IntPriorityGroupingGet \
        ROM_IntPriorityGroupingGet
#else
#define MAP_IntPriorityGroupingGet \
        IntPriorityGroupingGet
#endif
#ifdef ROM_IntPrioritySet
#define MAP_IntPrioritySet \
        ROM_IntPrioritySet
#else
#define MAP_IntPrioritySet \
        IntPrioritySet
#endif
#ifdef ROM_IntPriorityGet
#define MAP_IntPriorityGet \
        ROM_IntPriorityGet
#else
#define MAP_IntPriorityGet \
        IntPriorityGet
#endif
#ifdef ROM_IntPendSet
#define MAP_IntPendSet \
        ROM_IntPendSet
#else
#define MAP_IntPendSet \
        IntPendSet
#endif
#ifdef ROM_IntPendClear
#define MAP_IntPendClear \
        ROM_IntPendClear
#else
#define MAP_IntPendClear \
        IntPendClear
#endif

//*****************************************************************************
//
// Macros for the MPU API.
//
//*****************************************************************************
#ifdef ROM_MPUEnable
#define MAP_MPUEnable \
        ROM_MPUEnable
#else
#define MAP_MPUEnable \
        MPUEnable
#endif
#ifdef ROM_MPUDisable
#define MAP_MPUDisable \
        ROM_MPUDisable
#else
#define MAP_MPUDisable \
        MPUDisable
#endif
#ifdef ROM_MPURegionCountGet
#define MAP_MPURegionCountGet \
        ROM_MPURegionCountGet
#else
#define MAP_MPURegionCountGet \
        MPURegionCountGet
#endif
#ifdef ROM_MPURegionEnable
#define MAP_MPURegionEnable \
        ROM_MPURegionEnable
#else
#define MAP_MPURegionEnable \
        MPURegionEnable
#endif
#ifdef ROM_MPURegionDisable
#define MAP_MPURegionDisable \
        ROM_MPURegionDisable
#else
#define MAP_MPURegionDisable \
        MPURegionDisable
#endif
#ifdef ROM_MPURegionSet
#define MAP_MPURegionSet \
        ROM_MPURegionSet
#else
#define MAP_MPURegionSet \
        MPURegionSet
#endif
#ifdef ROM_MPURegionGet
#define MAP_MPURegionGet \
        ROM_MPURegionGet
#else
#define MAP_MPURegionGet \
        MPURegionGet
#endif

